---
kind: other
id: Properties.T:Autodesk.Revit.DB.RenderingQualitySettings
source: html/ae80e08f-c692-8c16-ab30-ce305b1e2ebe.htm
---
# RenderingQualitySettings Properties

Specifies whether the .NET object represents a valid Revit entity.